tutorials/cfdemSolverRhoPimpleChem/SingleParticleCases/30CO6H2_Hematite/CFD/constant/foam.inp
species
(
	H2
	H2O
	CO
	CO2
	N2
);

reactions
{
}


